hongquan-prog/GD32-Microcontrollers/GD32F450_FreeRTOS/Drivers/CMSIS/GD/GD32F4xx/Source/GCC/startup_gd32f450xx.s
   .weak      TIMER7_UP_TIMER12_IRQHandler            
   .thumb_set TIMER7_UP_TIMER12_IRQHandler,Default_Handler
         
   .weak      TIMER7_TRG_CMT_TIMER13_IRQHandler      
   .thumb_set TIMER7_TRG_CMT_TIMER13_IRQHandler,Default_Handler
      
   .weak      TIMER7_Channel_IRQHandler   
   .thumb_set TIMER7_Channel_IRQHandler,Default_Handler
                  
   .weak      DMA0_Channel7_IRQHandler               
   .thumb_set DMA0_Channel7_IRQHandler,Default_Handler
                     
   .weak      EXMC_IRQHandler            
   .thumb_set EXMC_IRQHandler,Default_Handler
                     
   .weak      SDIO_IRQHandler            
   .thumb_set SDIO_IRQHandler,Default_Handler
                     
   .weak      TIMER4_IRQHandler            
   .thumb_set TIMER4_IRQHandler,Default_Handler
                     
   .weak      SPI2_IRQHandler            
   .thumb_set SPI2_IRQHandler,Default_Handler
                     
   .weak      UART3_IRQHandler         
   .thumb_set UART3_IRQHandler,Default_Handler
                  
   .weak      UART4_IRQHandler         
   .thumb_set UART4_IRQHandler,Default_Handler
                  
   .weak      TIMER5_DAC_IRQHandler                  
   .thumb_set TIMER5_DAC_IRQHandler,Default_Handler
               
   .weak      TIMER6_IRQHandler            
   .thumb_set TIMER6_IRQHandler,Default_Handler
         
   .weak      DMA1_Channel0_IRQHandler               
   .thumb_set DMA1_Channel0_IRQHandler,Default_Handler
               
   .weak      DMA1_Channel1_IRQHandler               
   .thumb_set DMA1_Channel1_IRQHandler,Default_Handler
                  
   .weak      DMA1_Channel2_IRQHandler               
   .thumb_set DMA1_Channel2_IRQHandler,Default_Handler
            
   .weak      DMA1_Channel3_IRQHandler               
   .thumb_set DMA1_Channel3_IRQHandler,Default_Handler
            
   .weak      DMA1_Channel4_IRQHandler               
   .thumb_set DMA1_Channel4_IRQHandler,Default_Handler
   
   .weak      ENET_IRQHandler               
   .thumb_set ENET_IRQHandler,Default_Handler

   .weak      ENET_WKUP_IRQHandler               
   .thumb_set ENET_WKUP_IRQHandler,Default_Handler

   .weak      CAN1_TX_IRQHandler   
   .thumb_set CAN1_TX_IRQHandler,Default_Handler
                           
   .weak      CAN1_RX0_IRQHandler                  
   .thumb_set CAN1_RX0_IRQHandler,Default_Handler
                           
   .weak      CAN1_RX1_IRQHandler                  
   .thumb_set CAN1_RX1_IRQHandler,Default_Handler
                           
   .weak      CAN1_EWMC_IRQHandler                  
   .thumb_set CAN1_EWMC_IRQHandler,Default_Handler
                           
   .weak      USBFS_IRQHandler      
   .thumb_set USBFS_IRQHandler,Default_Handler
                     
   .weak      DMA1_Channel5_IRQHandler               
   .thumb_set DMA1_Channel5_IRQHandler,Default_Handler
                  
   .weak      DMA1_Channel6_IRQHandler               
   .thumb_set DMA1_Channel6_IRQHandler,Default_Handler
                  
   .weak      DMA1_Channel7_IRQHandler               
   .thumb_set DMA1_Channel7_IRQHandler,Default_Handler
                  
   .weak      USART5_IRQHandler      
   .thumb_set USART5_IRQHandler,Default_Handler
                        
   .weak      I2C2_EV_IRQHandler   
   .thumb_set I2C2_EV_IRQHandler,Default_Handler
                        
   .weak      I2C2_ER_IRQHandler   
   .thumb_set I2C2_ER_IRQHandler,Default_Handler
                        
   .weak      USBHS_EP1_Out_IRQHandler         
   .thumb_set USBHS_EP1_Out_IRQHandler,Default_Handler
               
   .weak      USBHS_EP1_In_IRQHandler            
   .thumb_set USBHS_EP1_In_IRQHandler,Default_Handler
               
   .weak      USBHS_WKUP_IRQHandler         
   .thumb_set USBHS_WKUP_IRQHandler,Default_Handler
            
   .weak      USBHS_IRQHandler      
   .thumb_set USBHS_IRQHandler,Default_Handler
                  
   .weak      DCI_IRQHandler            
   .thumb_set DCI_IRQHandler,Default_Handler
                                   
   .weak      TRNG_IRQHandler                  
   .thumb_set TRNG_IRQHandler,Default_Handler   

   .weak      FPU_IRQHandler                  
   .thumb_set FPU_IRQHandler,Default_Handler  

   .weak      UART6_IRQHandler            
   .thumb_set UART6_IRQHandler,Default_Handler

   .weak      UART7_IRQHandler            
   .thumb_set UART7_IRQHandler,Default_Handler

   .weak      SPI3_IRQHandler            
   .thumb_set SPI3_IRQHandler,Default_Handler

   .weak      SPI4_IRQHandler            
   .thumb_set SPI4_IRQHandler,Default_Handler

   .weak      SPI5_IRQHandler            
   .thumb_set SPI5_IRQHandler,Default_Handler

   .weak      TLI_IRQHandler            
   .thumb_set TLI_IRQHandler,Default_Handler

   .weak      TLI_ER_IRQHandler            
   .thumb_set TLI_ER_IRQHandler,Default_Handler

   .weak      IPA_IRQHandler            
   .thumb_set IPA_IRQHandler,Default_Handler
